//Numbers
// IEEE 754- 64-битный формат для представления чисел; Представляет числа: от +- 1.8*10^308 до 5*10^-324;
// Переменные находяшиеся в уровнении называются аперантами, а (+,-,/,*,%)-операторами;
//Операторы бывают унарные - работает только с одной переменной(занчением):(-a) - в основном меняется только знак перед переменной , бинарные - работает с 2-мя переменными(значениями): (a+b)
/*0 / 0 = NaN
'2' / 'Hello' = NaN
'10' / 2 = 5
'2' + 3 = '23'
*/
/*
var a = 0.3 - 0.2; // Должно быть 0.1

var b = 0.2 - 0.1; // Должно быть 0.1

alert(a); // Показывается 0.09999999999999998
alert(b); // Показывается 0.1
*/
// '\' - экронирует следующий символ в строке
// Оператор равенства '==' , оператор идентичности '==='
// '10' == 10 - true ; '10' === 10 - false;
/* Оператор &&
10 && 20 - 20
true && false - false
true && true - true
*/
/*
Оператор (++ --) ++a = a+1
*/
/**
* TODO Вопрос : тренарные операторы
 **/